DeltaNova/STM32/WS2812/ws2812.cpp
    colorWipe(0x32, 0x2d, 0x91,pixels,20);
    colorWipe(0xe6, 0xd1, 0x17,pixels,20);
    colorWipe(0x73, 0x12, 0x1f,pixels,20);
    colorWipe(0x61, 0xa3, 0xe6,pixels,20);
    colorWipe(0xe6, 0x89, 0x10,pixels,20);
    colorWipe(0x65, 0xbf, 0x74,pixels,20);
    
    CylonBounce(0x25,0x73,0x22,4,10,30);
    
    counter = 15000;
    while(counter){
        Sparkle(255,255,255,pixels,3); // White Sparkle
    }
    
    counter = 15000;
    while(counter){
        Sparkle(getRandomNumber(0,255),getRandomNumber(0,255),getRandomNumber(0,255),pixels,3);
    }
    

    RunningLights(255,255,255,pixels,30);//WHITE

    CylonBounce(0xad,0x1a,0x4b,4,10,30);

    for(i = 0; i<3; i++){
        theaterChase(0xff,0,0,30);
    }
    
    for(i = 0; i<3; i++){
        theaterChase(0x0c,0x5e,0x9c,20);
    }
    
     for(i = 0; i<3; i++){
        theaterChase(0x97,0x21,0x9C,10);
    }
    
    colorWipe(0xff, 0xbd, 0x38,pixels,20);
    colorWipe(0x17, 0xc5, 0x15,pixels,20);
    colorWipe(0x5c, 0x19, 0x1d,pixels,20);
    colorWipe(0x64, 0x37, 0x88,pixels,20);
    colorWipe(0xc4, 0x2d, 0xba,pixels,20);
    
    counter = 30000;
    while(counter){
        Fire(55,120,15);
    }
}
*/



int getRandomNumber(int min, int max){
    // Generate a random number between min and max (inclusive)
    // Assumes std::srand() has already been called
    // Assumes max - min <= RAND_MAX
    static const double fraction = 1.0 / (RAND_MAX + 1.0);  // static used for efficiency, so we only calculate this value once
    // evenly distribute the random number across our range
    return min + static_cast<int>((max - min + 1) * (std::rand() * fraction));
}

/*
void CylonBounce(uint8_t R, uint8_t G, uint8_t B, int EyeSize, int SpeedDelay, int ReturnDelay){
  for(int i = 0; i < NUM_LEDS-EyeSize-2; i++) {
    setAllRGB(0,0,0,pixels);
    setPixelRGB(R/10, G/10, B/10, i,pixels);
    for(int j = 1; j <= EyeSize; j++) {
      setPixelRGB(R, G, B, i+j, pixels); 
    }
    setPixelRGB(R/10, G/10, B/10, i+EyeSize+1, pixels);
    writeLED(pixels,NUM_LEDS, DMA_Buffer);
    delay_ms(SpeedDelay);
  }
  delay_ms(ReturnDelay);
  for(int i = NUM_LEDS-EyeSize-2; i > 0; i--) {
    setAllRGB(0,0,0,pixels);
    setPixelRGB(R/10, G/10, B/10,i,pixels);
    for(int j = 1; j <= EyeSize; j++) {
      setPixelRGB(R, G, B, i+j, pixels); 
    }
    setPixelRGB(R/10, G/10, B/10,i+EyeSize+1, pixels);
    writeLED(pixels,NUM_LEDS, DMA_Buffer);
    delay_ms(SpeedDelay);
  }
  delay_ms(ReturnDelay);

}
*/


/*
void RGBLoop(uint8_t (&array)[][3], uint8_t LEDS){
  for(int j = 0; j < 3; j++ ) { 
    // Fade IN
    for(int k = 0; k < 256; k++) { 
      switch(j) { 
        case 0: setAllRGB(k,0,0,array); break;
        case 1: setAllRGB(0,k,0,array); break;
        case 2: setAllRGB(0,0,k,array); break;
      }

      writeLED(array,LEDS,DMA_Buffer);
      delay_ms(3);
    }

    // Fade OUT
    for(int k = 255; k >= 0; k--) { 
      switch(j) { 
        case 0: setAllRGB(k,0,0,array); break;
        case 1: setAllRGB(0,k,0,array); break;
        case 2: setAllRGB(0,0,k,array); break;
      }
      writeLED(array,LEDS,DMA_Buffer);
      delay_ms(3);
    }
  }
}
*/
/*
void Sparkle(uint8_t R, uint8_t G, uint8_t B, uint8_t (&array)[NUM_LEDS][3], uint8_t SpeedDelay) {

  uint8_t Pixel = getRandomNumber(0,NUM_LEDS);
  setPixelRGB(R,G,B,Pixel,array);
  writeLED(array,NUM_LEDS,DMA_Buffer);
  delay_ms(SpeedDelay);
  setPixelRGB(0,0,0,Pixel,array);
}
*/
/*
void SnowSparkle(uint8_t R, uint8_t G, uint8_t B, uint8_t (&array)[NUM_LEDS][3], uint16_t SparkleDelay, uint16_t SpeedDelay) {
    
     // SparkleDelay - Delay Time in ms (0-65535)
     // SpeedDelay   - Delay Time in ms (0-65535)
     // REQ: NUM_LEDS <= 255
     
    
    // Compile Time Check for global NUM_LED value 
    static_assert(NUM_LEDS > 0, "SnowSparkle - NUM_LEDS needs to be > 0");
    static_assert(NUM_LEDS <= 255, "SnowSparkle - NUM_LEDS needs to be <= 255");
    
    setAllRGB(R,G,B,array);             // Fill LED Array with specified colour.
    uint8_t Pixel = getRandomNumber(0,NUM_LEDS);    // Pick an LED at random
  
    // Change the colour of the selected for a short ammount of time.
    setPixelRGB(0xff,0xff,0xff, Pixel,array); // Set LED Colour
    writeLED(array,NUM_LEDS,DMA_Buffer);      // Update ALL LEDs
    delay_ms(SparkleDelay);                   // Hold ALL LED colours
  
    setPixelRGB(R,G,B,Pixel,array);           // Set ALL LEDs to initial value
    writeLED(array,NUM_LEDS,DMA_Buffer);      // Update ALL LEDs.
    delay_ms(SpeedDelay);                     // Hold ALL LED colours.
}

void colorWipe(uint8_t R, uint8_t G, uint8_t B, uint8_t (&array)[NUM_LEDS][3], uint16_t SpeedDelay) {
     // SpeedDelay   - Delay Time in ms (0-65535)
     //REQ: NUM_LEDS <= 255
     //
     //SpeedDelay controls how long to wait before changing colour of next LED
     //
     
    // Compile Time Check for global NUM_LED value 
    static_assert(NUM_LEDS > 0, "colorWipe - NUM_LEDS needs to be > 0");
    static_assert(NUM_LEDS <= 255, "colorWipe - NUM_LEDS needs to be <= 255");
    
    uint8_t i;
    for(i=0; i<NUM_LEDS; i++) {             // For each LED in turn
      setPixelRGB(R, G, B, i, array);       // Set the new colour of the LED
      writeLED(array,NUM_LEDS,DMA_Buffer);  // Update ALL LED colours
      delay_ms(SpeedDelay);                 // Wait before next LED
  }
}
*/
// TODO: ADD FadeInOut
// TODO: ADD rainbow cycle effect

// TODO@ ADD Bouncing Balls
// TODO: ADD Multi Colour Bouncing Balls

/*
void Fire(int Cooling, int Sparking, int SpeedDelay) {
  static uint8_t heat[NUM_LEDS];
  int cooldown;
  // Step 1.  Cool down every cell a little
  for( int i = 0; i < NUM_LEDS; i++) {
    cooldown = getRandomNumber(0, ((Cooling * 10) / NUM_LEDS) + 2);
    if(cooldown>heat[i]) {
      heat[i]=0;
    } else {
      heat[i]=heat[i]-cooldown;
    }
  }

  // Step 2.  Heat from each cell drifts 'up' and diffuses a little
  for( int k= NUM_LEDS - 1; k >= 2; k--) {
    heat[k] = (heat[k - 1] + heat[k - 2] + heat[k - 2]) / 3;
  }

